examples/render_all_grammars/dot/tests_functional_test_scoping_metamodel_provider2_Recipe.dot
    digraph xtext {
    fontname = "Bitstream Vera Sans"
    fontsize = 8
    node[
        shape=record,
        style=filled,
        fillcolor=aliceblue
    ]
    nodesep = 0.3
    edge[dir=black,arrowtail=empty]


39874184[ label="{Model|}"]

39861592[ label="{ID|}"]

39866536[ label="{STRING|}"]

39967464[ label="{BOOL|}"]

39952984[ label="{INT|}"]

39852248[ label="{FLOAT|}"]

39978456[ label="{STRICTFLOAT|}"]

39590152[ label="{NUMBER|}"]

39797736[ label="{BASETYPE|}"]

39871128[ label="{*OBJECT|}"]

39616376[ label="{Recipe|}"]

39592648[ label="{Ingredient|+count:POS_FLOAT\l}"]

39801272[ label="{IngredientType|+name:ID\l}"]

40052392[ label="{Unit|+weight:POS_FLOAT\l+name:ID\l}"]

40128392[ label="{POS_FLOAT|\\d+ . UINT\?}"]

39990088[ label="{UINT|\\d+}"]



39874184 -> 39616376[arrowtail=diamond, dir=both, headlabel="recipe "]
39590152 -> 39978456 [dir=back]
39590152 -> 39952984 [dir=back]
39797736 -> 39590152 [dir=back]
39797736 -> 39852248 [dir=back]
39797736 -> 39967464 [dir=back]
39797736 -> 39861592 [dir=back]
39797736 -> 39866536 [dir=back]
39871128 -> 39797736 [dir=back]
39616376 -> 39592648[arrowtail=diamond, dir=both, headlabel="ingredients 1..*"]
39592648 -> 40052392[headlabel="unit "]
39592648 -> 39801272[headlabel="type "]
39801272 -> 39801272[headlabel="extends "]
39801272 -> 40052392[arrowtail=diamond, dir=both, headlabel="units 1..*"]

}
